In [54]:
import pandas as pd
from sklearn.model_selection import train_test_split

train_df = pd.read_csv('train.csv')
test_df = pd.read_csv('test.csv')

df = pd.concat([train_df, test_df])

train, test = train_test_split(df, test_size=0.2, random_state=42)

train.head()

C:\Users\Me\AppData\Local\Temp\ipykernel_13204\703557257.py:4: DtypeWarning: Columns (26) have mixed types. Specify dtype option on import or set low_memory=False.
  train_df = pd.read_csv('train.csv')

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
4025,0x4533,CUS_0x5937,October,NaN,23,771-83-2093,Musician,15680.0,1571.666667,7,...,_,1823.34,31.791251,18 Years and 4 Months,Yes,27.052764,57.40564219859033,High_spent_Small_value_payments,332.7082601731303,NaN
5415,0x35b9,CUS_0x78bf,August,Nanette Byrnest,41,902-32-7521,Accountant,61796.92,5318.743333,9,...,Bad,3133.49,22.910706,NaN,Yes,334.461662,328.06800995409225,Low_spent_Small_value_payments,159.34466115523168,Poor
75612,0x1d10a,CUS_0x82a5,May,Zahariay,21,462-17-4966,Engineer,34365.96,2993.830000,8,...,Standard,2011.12,36.841790,7 Years and 0 Months,Yes,52.203311,180.18321142219108,Low_spent_Medium_value_payments,346.99647717113993,Poor
38169,0x1d553,CUS_0x6ba9,October,NaN,45,862-17-7073,Lawyer,20272.23,1776.352500,4,...,_,828.97,38.835886,27 Years and 10 Months,No,11.480150,71.26241360128027,High_spent_Medium_value_payments,344.8926859843145,NaN
87184,0x214da,CUS_0x2e0e,January,Zao,940,215-57-4977,Mechanic,61085.5,4842.458333,8,...,Good,293.01,38.618098,23 Years and 4 Months,No,36941.000000,162.30958010521113,High_spent_Medium_value_payments,473.12832673114656,Good

In [55]:
test.head()

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
59770,0x17438,CUS_0xb912,March,N.k,31_,297-60-0692,Musician,12524.625,NaN,5,...,Standard,689.18,34.558473,5 Years and 6 Months,NM,0.000000,80.29001728923474,Low_spent_Medium_value_payments,289.48185771076527,Standard
21362,0x932c,CUS_0xacd6,March,Nadia Damounir,42,333-29-1726,Engineer,83245.14,7037.095000,2,...,Good,1229.4,29.149179,20 Years and 7 Months,No,67.692175,77.79720292695758,High_spent_Large_value_payments,798.2201220631251,Standard
27324,0x1563e,CUS_0x97d,September,Markm,35,004-06-1187,Accountant,8940.905,985.556904,7,...,Bad,2558.29,36.265011,4 Years and 9 Months,Yes,40.097649,90.74562811468624,Low_spent_Small_value_payments,262.68277665862485,NaN
40509,0x1f0bf,CUS_0x9f8e,October,Deepa Seetharamano,27,627-39-8653,Architect,19504.32,1554.360000,7,...,Standard,1882.8,28.603402,16 Years and 0 Months,Yes,17.310437,166.9142013244005,Low_spent_Small_value_payments,261.21136173324834,NaN
44297,0x21d23,CUS_0x4b8b,October,Valetkevitchu,19,842-07-2442,Accountant,160346.44,NaN,2,...,Good,630.62,32.260522,22 Years and 1 Months,No,297.893363,994.0617327378767,Low_spent_Small_value_payments,359.1652380031295,NaN

**1. Data Cleaning and Preprocessing:**
So many missing values, we will need to treat each column depending on the nature of the data in each column and the overall context of your project.

In [56]:
missing_values = df.isnull().sum()
missing_values[missing_values > 0]

Name                       15000
Monthly_Inhand_Salary      22500
Type_of_Loan               17112
Num_of_Delayed_Payment     10500
Num_Credit_Inquiries        3000
Credit_History_Age         13500
Amount_invested_monthly     6750
Monthly_Balance             1762
Credit_Score               50000
dtype: int64

In [57]:
#<--Name-->
name_value_counts = df['Name'].value_counts()
top_names = name_value_counts.head(10)
num_unique_names = df['Name'].nunique()

df = df.copy()
df['Name'].fillna('J. Doe', inplace=True)
df['Name'].isnull().sum()

top_names, num_unique_names

(Name
 Stevex                66
 Langep                65
 Jessicad              59
 Vaughanl              58
 Raymondr              58
 Deepa Seetharamanm    58
 Jessica Wohlt         57
 Nicko                 57
 Ronald Groverk        56
 Jonesb                55
 Name: count, dtype: int64,
 10139)

In [58]:
# <--Monthly_Inhand_Salary-->
salary_distribution = df['Monthly_Inhand_Salary'].describe()
print(salary_distribution)

df['Monthly_Inhand_Salary'].isna().sum()

median_salary = df['Monthly_Inhand_Salary'].median() #<--- given the distribution of the "Monthly_Inhand_Salary" column. see(Skewed Distribution, Range Values, Median value)
df['Monthly_Inhand_Salary'].fillna(median_salary, inplace=True)

count    127500.000000
mean       4190.115139
std        3180.489657
min         303.645417
25%        1625.265833
50%        3091.000000
75%        5948.454596
max       15204.633333
Name: Monthly_Inhand_Salary, dtype: float64

In [71]:
# <--Type of Loan-->
loan_type_counts = df['Type_of_Loan'].value_counts()

top_loan_types = loan_type_counts.head(10)
num_unique_loan_types = df['Type_of_Loan'].nunique()

df['Type_of_Loan'].isna().sum()


df['Type_of_Loan'].fillna('Not Specified', inplace=True)   #<--- given the distribution of the "Type_of_Loan" column. see(Not Specified, Range Values)


top_loan_types, num_unique_loan_types

(Type_of_Loan
 Not Specified                      19224
 Credit-Builder Loan                 1920
 Personal Loan                       1908
 Debt Consolidation Loan             1896
 Student Loan                        1860
 Payday Loan                         1800
 Mortgage Loan                       1764
 Auto Loan                           1728
 Home Equity Loan                    1704
 Personal Loan, and Student Loan      480
 Name: count, dtype: int64,
 6260)

In [70]:
# <--Number of Delayed Payments-->
data_type_delayed_payments = df['Num_of_Delayed_Payment'].dtype

df['Num_of_Delayed_Payment'] = pd.to_numeric(df['Num_of_Delayed_Payment'], errors='coerce') #<--- numbers into numeric types
skewness_delayed_payments = df['Num_of_Delayed_Payment'].skew()
summary_delayed_payments = df['Num_of_Delayed_Payment'].describe()

data_type_delayed_payments, skewness_delayed_payments, summary_delayed_payments

(dtype('float64'),
 14.336422664155652,
 count    135329.000000
 mean         30.937020
 std         224.723576
 min          -3.000000
 25%           9.000000
 50%          14.000000
 75%          18.000000
 max        4399.000000
 Name: Num_of_Delayed_Payment, dtype: float64)

In [72]:
# <--Number of Delayed Payments--> cell 2
df['Num_of_Delayed_Payment'] = df['Num_of_Delayed_Payment'].apply(lambda x: 0 if x < 0 else x)

percentile_95 = df['Num_of_Delayed_Payment'].quantile(0.95)  #<--- reducing the impact of extreme outliers
df['Num_of_Delayed_Payment'] = df['Num_of_Delayed_Payment'].apply(lambda x: percentile_95 if x > percentile_95 else x)

median_delayed_payments = df['Num_of_Delayed_Payment'].median()
df['Num_of_Delayed_Payment'].fillna(median_delayed_payments, inplace=True)

new_summary_delayed_payments = df['Num_of_Delayed_Payment'].describe()
new_summary_delayed_payments

count    150000.000000
mean         13.443027
std           5.947961
min           0.000000
25%           9.000000
50%          14.000000
75%          18.000000
max          24.000000
Name: Num_of_Delayed_Payment, dtype: float64